uat_chat/Reports/уатЖурналПутЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>уатЖурналПутЛистов</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПЛ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыПЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьОбложку</Name>
					<Comment>Признак печати обложки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСВыбыло</Name>
					<Comment>ТС выбыло</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

uat_chat/InformationRegisters/уатСведенияОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатСведенияОСотрудниках</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>идДОк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.уатОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Reports/уатЖурналПутЛистов/Ext/ObjectModule.bsl
#Если Клиент Тогда

Перем НП Экспорт; // Настройка периода отчета


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//  ДокументРезультат - табличный документ, формируемый отчетом
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт
	
	Макет = ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатПутевойЛист.Номер,
	|	уатПутевойЛист.Водитель1 КАК Водитель,
	|	уатПутевойЛист.ТранспортноеСредство,
	|	уатПутевойЛист.Ссылка,
	|	уатПутевойЛист.ДатаВыезда КАК ДатаВыезда,
	|	уатСведенияОСотрудникахСрезПоследних.ТабельныйНомер
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(&ДатаКон, ) КАК уатСведенияОСотрудникахСрезПоследних
	|		ПО уатПутевойЛист.Водитель1 = уатСведенияОСотрудникахСрезПоследних.Сотрудник
	|ГДЕ
	|	уатПутевойЛист.ПометкаУдаления = &ПометкаУдаления
	|	И уатПутевойЛист.ДатаВыезда >= &ДатаНач
	|	И уатПутевойЛист.ДатаВыезда <= &ДатаКон
	|	И ВЫБОР
	|			КОГДА &ТСВыбыло
	|				ТОГДА уатПутевойЛист.ТранспортноеСредство.ДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
	|			КОГДА НЕ &ТСВыбыло
	|				ТОГДА уатПутевойЛист.ТранспортноеСредство.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ";

	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Если ДатаКон = '00010101' Тогда
		Запрос.УстановитьПараметр("ДатаКон", '39991231');
	Иначе
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	КонецЕсли;
	
	Если Не уатОбщегоНазначения.уатЗначениеНеЗаполнено(Организация) Тогда
		Запрос.Текст = Запрос.Текст +
		" И
		|	уатПутевойЛист.Организация = &Организация
		|";
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	Если Не уатОбщегоНазначения.уатЗначениеНеЗаполнено(ВидПЛ) Тогда
		Запрос.Текст = Запрос.Текст +
		"
		|	И
		|	уатПутевойЛист.ВидПЛ = &ВидПЛ";
		Запрос.УстановитьПараметр("ВидПЛ", ВидПЛ);
	КонецЕсли;	

	Запрос.Текст = Запрос.Текст +
	"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыезда";
	
	Запрос.УстановитьПараметр("ТСВыбыло", ТСВыбыло);	
	
	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ДокументРезультат.Очистить();
	
	Если ПечататьОбложку Тогда
		ОбластьЗаголовок.Параметры.Организация = Организация.НаименованиеПолное;
		ДокументРезультат.Вывести(ОбластьЗаголовок);
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;	
		
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	ДокументРезультат.НачатьАвтогруппировкуСтрок();

	ВыборкаДетали = Результат.Выбрать();

	Пока ВыборкаДетали.Следующий() Цикл
		докПЛ = ВыборкаДетали.Ссылка;
		рсТранспортноеСредство = уатОбщегоНазначения.уатПрочитатьРеквизитыТС(ВыборкаДетали.ТранспортноеСредство);
		ОбластьДетальныхЗаписей.Параметры.ТранспортноеСредствоГарНомер	= рсТранспортноеСредство.ГаражныйНомер;
		ОбластьДетальныхЗаписей.Параметры.ВодительФИО	= уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ВыборкаДетали.Водитель);
		ОбластьДетальныхЗаписей.Параметры.ВодительТН	= ВыборкаДетали.ТабельныйНомер;
		ОбластьДетальныхЗаписей.Параметры.РасшифровкаТС	= ВыборкаДетали.ТранспортноеСредство;
		ОбластьДетальныхЗаписей.Параметры.РасшифровкаВодитель	= ВыборкаДетали.Водитель;
		ОбластьДетальныхЗаписей.Параметры.РасшифровкаПЛ	= ВыборкаДетали.Ссылка;

		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
		ДокументРезультат.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетали.Уровень());
	КонецЦикла;

	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПовторятьПриПечатиСтроки = ОбластьШапкаТаблицы;
	ДокументРезультат.ТолькоПросмотр = уатПраваИНастройки.уатПраво("ЗащитаПечатныхФорм", глПраваУАТ);
			
КонецПроцедуры // СформироватьРезультат()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

НП = Новый НастройкаПериода;

#КонецЕсли
